app/controllers/bugs_controller.rb

INSERT INTO `bugs` (`kind`, `attachment_file_name`, `attachment_content_type`, `attachment_file_size`, `created_at`, `updated_at`, `closed`, `user_id`, `content`, `user_ip`, `user_agent`, `attachment_updated_at`, `handled`) VALUES(NULL, NULL, NULL, NULL, '2010-08-01 13:38:31', '2010-08-01 13:38:31', 0, NULL, '这就是我的意见', '192.168.1.3', 'Mozilla/5.0 (Windows; U; Windows NT 5.1; zh-CN; rv:1.9.2.8) Gecko/20100722 Firefox/3.6.8 GTB7.1', NULL, 0)
SELECT `users`.* FROM `users` inner join user_roles on users.id=user_roles.user_id inner join roles on roles.id=user_roles.role_id where roles.name='Admin'
---
  def create
    @bug = Bug.new(params[:bug])
    @bug.user_agent = request.user_agent
    if logged_in?
      @bug.user = current_user
      return create_success if @bug.save
    else
      @bug.user_ip = request.remote_ip
      return create_success if @bug.save_with_captcha
    end
    responds_to_parent do
      render_ui do |ui|
        ui.page << "$('new_bug').update(#{(render :partial=>"bugs/form_bug",:locals=>{:bug=>@bug}).to_json})"