app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `logo_updated_at`, `v09_up`, `created_at`, `activated_at`, `last_login_time`, `reset_password_code_until`, `updated_at`, `hashed_password`, `activation_code`, `logo_file_name`, `reset_password_code`, `sign`, `logo_content_type`, `logo_file_size`, `v09`, `email`) VALUES('洋气书生', '935646400.296080517120877', NULL, NULL, '2010-07-31 18:40:04', NULL, NULL, NULL, '2010-07-31 18:40:04', '0c1a1c947baa0a994003d3f879c7c3687b9efd6b', 'bdf90f2d-fcbe-4c20-b12e-27341959b259', NULL, NULL, NULL, NULL, NULL, NULL, 'ben7th@sina.com')
---
  def create
    # 出于安全性考虑，新用户注册时销毁cookies令牌
    destroy_cookie_token
    @user=User.new(params[:user])

    # 生成验证码、验证码过期时间、初始激活状态
    @user.create_activation_code

SELECT * FROM `contactings` WHERE (`contactings`.`contact_id` = 1)
SELECT * FROM `shares` WHERE (`shares`.creator_id = 1) ORDER BY created_at desc LIMIT 0, 30
---
  def show
    @user=User.find(params[:id])
    if logged_in? && @user == current_user
      @user_shares = @user.my_and_contacting_shares.paginate(:page => params[:page] ,:per_page=>30 )

SELECT * FROM `users` WHERE (`users`.`email` = '') LIMIT 1
---
  def forgot_password
    @user = User.find_by_email(params[:email])